platform: "tensorflow_savedmodel"
max_batch_size: 1
input [
  {
    name: "input_2"
    data_type: TYPE_FP32
    dims: [15, 300, 300, 3]
  }
]
output [
  {
    name: "dense"
    data_type: TYPE_FP32
    dims: [8]
  }
]

optimization { execution_accelerators {
  gpu_execution_accelerator : [
    { name : "auto_mixed_precision" }
  ]
}}

dynamic_batching {}

instance_group [
    {
      count: 1
      kind: KIND_GPU
      gpus: [ 0 ]
    }
  ]

model_warmup {
    name: "Warmup1"
    batch_size: 1
    inputs: {
        key: "input_2"
        value: {
            dims: 15
            dims: 300
            dims: 300
            dims: 3
            data_type: TYPE_FP32
            zero_data: true
        }
     }
}
